hjgqx996/stm32f0-contiki/src/dev/driver_config.c
/*========================================================

* file name 		:	drv_config.c
* Author 			:	kaihua.yang
* Version			：	v1.00
* Date				：	11/30/2015
* Description		：	硬件驱动配置文件

*********************************************************
*与硬件有关部分在 Configure or interface给出
*********************************************************
========================================================*/
/******************************************************************
			includes
*******************************************************************/
#include "config.h"
#include "driver_config_types.h"
#include "types.h"
//#include "gtDev.h"

/******************************************************************
			private
*******************************************************************/


/******************************************************************
			configure variables
*******************************************************************/
//-------- <<< Use Configuration Wizard in Context Menu >>> -----------------
/*****************
   外部时钟配置
*****************/
//<o> 时钟--外部晶振


/*****************
   IDWG 常量配置
*****************/
//<o> iwdg
//const unsigned int iwatchdog_xpres =  IWATCHDOG_XPRES;
//const unsigned int iwatchdog_xsetr =  IWATCHDOG_XSETR;

#include "stm32f0xx.h"

/***********************
			GPIO  配置常量
***********************/
#define PORT_A 0
#define PORT_B 1
#define PORT_C 2
#define PORT_D 3
#define PORT_E 4
#define PORT_F 5
#define PORT_HC  0xFF  
#define OUT(pp,pin)  {PORT_##pp,pin,GPIO_Mode_OUT,GPIO_OType_PP,GPIO_PuPd_NOPULL,GPIO_Speed_Level_3,0},
#define OUTH(pp,pin) {PORT_##pp,pin,GPIO_Mode_OUT,GPIO_OType_PP,GPIO_PuPd_NOPULL,GPIO_Speed_Level_3,1},
#define ODH(pp,pin)  {PORT_##pp,pin,GPIO_Mode_OUT,GPIO_OType_OD,GPIO_PuPd_NOPULL,GPIO_Speed_Level_3,1},
#define IN(pp,pin)   {PORT_##pp,pin,GPIO_Mode_IN,GPIO_OType_OD,GPIO_PuPd_NOPULL,GPIO_Speed_Level_3,0},
#define AF(pp,pin)   {PORT_##pp,pin,GPIO_Mode_AF,GPIO_OType_PP,GPIO_PuPd_UP,GPIO_Speed_Level_3,0},

//<o> gpio
t_gpio_map gpio_map[]=
{
	//系统LED灯    485发送使能                                                                    
	  OUT(F,5)     OUT(A,1)

#if APP_USING_25_50_MACHINE >0	
	//电磁阀 摆臂开关 到位开关  红外发送  红外接收   led灯      充电使能  充电输出检测     sda       scl
	OUT(C,2) IN(B,10) IN(B,15)  OUT(HC,2)  IN(F, 4)  OUT(HC,0)  OUT(HC,1)  IN(C,0)         ODH(B,8)  ODH(B,9)  //仓道1
	OUT(C,3) IN(B,1)  IN(A,8)   OUT(HC,6)  IN(F, 0)  OUT(HC,4)  OUT(HC,5)  IN(C,1)         ODH(B,6)  ODH(B,7)  //仓道2
	OUT(B,14)IN(A,0)  IN(F,6)   OUT(HC,7)  IN(F, 1)  OUT(HC,8)  OUT(HC,9)  IN(C,5)         ODH(B,4)  ODH(B,5)  //仓道3
	OUT(B,11)IN(C,13) IN(F,7)   OUT(HC,10) IN(B,12)  OUT(HC,12) OUT(HC,13) IN(C,4)         ODH(D,2)  ODH(B,3)  //仓道4
	OUT(C,6) IN(C,9)  IN(A,12)  OUT(HC,11) IN(C,7)   OUT(HC,14) OUT(HC,15) IN(B,13)        ODH(C,11) ODH(C,12)  //仓道5
#endif
	
#if APP_USING_8_16_MACHINE	>0
	//电磁阀 摆臂开关 到位开关  红外发送  红外接收   led灯      充电使能  充电输出检测     sda       scl
	OUT(C,9) IN(B,10) IN(B,15)  OUT(C, 8)  IN(A,12)  OUT(A, 7)  OUT(B, 3)  IN(C,0)         ODH(B,8)  ODH(B,9)  //仓道1
	OUT(C,7) IN(B,1)  IN(A,8)   OUT(C, 3)  IN(A,11)  OUT(A, 6)  OUT(A,15)  IN(C,1)         ODH(B,6)  ODH(B,7)  //仓道2
	OUT(B,14)IN(A,0)  IN(F,6)   OUT(B, 2)  IN(B, 0)  OUT(A, 5)  OUT(B, 5)  IN(C,5)         ODH(C,12) ODH(D,2)  //仓道3
	OUT(B,12)IN(C,13) IN(F,7)   OUT(B,11)  IN(B,13)  OUT(A, 4)  OUT(B, 4)  IN(C,4)         ODH(C,10) ODH(C,11)  //仓道4
	//电磁阀电源使能
	OUT(C,2)
#endif
   0,
};
const unsigned char gpio_number = (sizeof(gpio_map)/sizeof(t_gpio_map)) - 1;

/***********************
			EXTI  配置常量
***********************/
#define exti(pp,pin)  {PORT_##pp,pin,pin,EXTI_Trigger_Rising},
//<o> exti
t_exti_map exti_map[]={
	
//	//摆臂      
//	exti(B,10)  //仓道1
//	exti(B, 1)  //仓道2
//	exti(A, 0)  //仓道3
//	exti(C,13)  //仓道4
//	exti(C, 9)  //仓道5

#if APP_USING_25_50_MACHINE >0		
	//到位
	exti(B,15)  //仓道1
	exti(A, 8)  //仓道2
	exti(F, 6)  //仓道3
	exti(F, 7)  //仓道4
	exti(A,12)  //仓道5
#endif

#if APP_USING_8_16_MACHINE >0		
	//到位
	exti(B,15)  //仓道1
	exti(A, 8)  //仓道2
	exti(F, 6)  //仓道3
	exti(F, 7)  //仓道4
//	exti(A,12)  //仓道5
#endif
	
	0
};
const unsigned char exti_number = (sizeof(exti_map) /sizeof(t_exti_map)) - 1;
/*************************
			Uart
*************************/
//<o> uart
t_uart_map uart_map[] = {
  
	{AF(A,9) AF(A,10) 1},  //uart1 
	{AF(A,2) AF(A,3) 2},   //uart2 
	{0}	
};
const unsigned char uart_number = sizeof(uart_map) /(sizeof(t_uart_map)) - 1;
